Table of Contents
 Class RebarSegment3DArc3Pts
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
Represents an arc segment in 3D space defined by 3 points Start, End and a Point between start and end point.
public class RebarSegment3DArc3Pts : RebarSegment3DBase
Inheritance
object
OpenObject
RebarSegment3DBase
RebarSegment3DArc3Pts
Inherited Members
 RebarSegment3DBase.EndPoint
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 ThirdPoint
Gets or sets the point of circular arc somewhere between start and end point.
public Point3D ThirdPoint { get; set; }
Property Value
Point3D
 Edit this page